# ScheduleMark Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..ScheduleMark Property
Rebar Class See Also
---
The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string ScheduleMark { get; set; }
```

Visual Basic
---
```text
Public Property ScheduleMark As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ScheduleMark {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace